{
    "bingo" : {
        "name" : "Local Bingo",
        "linkname" : "bingo",
        "technologies" : "React, Express, MongoDB, Mongoose, Node.js, HTML, CSS, Javascript, MUI, JWT",
        "description" : "Host your own Bingo league for events (work, social, or otherwise) using customizable prompts, leaderboards, and user roles.",
        "mainImage" : ["../src/assets/projectphotos/bingo/bingo-lit.png", "The main game screen"],
        "mobileMainImage" : ["../src/assets/projectphotos/bingo/bingo-lit.png", "The main game screen"],
        "navlink" : ["https://github.com/Kyle-Rachman/Local-Bingo", "Check It Out"],
        "briefing" : "People have quirks. It's simply a fact of life. I love my church and all the people there with all of our idiosyncracies, so I decided to make a bingo game to celebrate our unique (and sometimes funny) features that seem to come out at our Sunday gatherings. Of course, this could easily be adapted to play 'meeting bingo' in other instances. The game needed to change every week, be mobile responsive, and feature a way for users to keep score.",
        "featureImage1" : ["../src/assets/projectphotos/bingo/admin.png", "Admin console", "The game features secure, role-based authentication to give users various privileges."],
        "featureImage2" : ["../src/assets/projectphotos/bingo/squares.png", "The square list screen", "A screen where prompt managers and admins could add/change squares for the game. Normal users had view access here."],
        "bigFeatureImage" : ["../src/assets/projectphotos/bingo/bingo-unlit.png", "The main game screen", "From the main game screen, a logged in player can view their profile, the list of prompts, or the leaderboad."],
        "solutionImage" : ["../src/assets/projectphotos/bingo/phone-mockup.png", "The profile screen on a phone"],
        "solution" : "I created a MERN app to allow users to synchronously play bingo, with the board layout randomly assigned for each user each week. The app had a sortable leaderboard for users, and also capped them at getting bingo once per week (to prevent spoofing extra wins). It also allowed users to mildly customize their profile for a more social aspect. In the end, my fellow church members loved the app for highlighting some of our fun moments each week!"
    },
    "math" : {
        "name" : "Mathematics",
        "linkname" : "math",
        "technologies" : "LaTeX, Linear Algebra, Abstract Algebra, Discrete Mathematics, Probability & Measure Theory, Topology, Analysis",
        "description" : "I earned my B.S. and M.S. in Mathematics from California Polytechnic State University, San Luis Obispo. I completed both degrees simultaneously in four years, graduating in 2021.",
        "mainImage" : ["../src/assets/projectphotos/math/triangle-of-triangles.jpg", "A moduli space for triangles, developed in conjunction with the 2018-2019 Simple Group"],
        "mobileMainImage" : ["../src/assets/projectphotos/math/triangle-of-triangles-mobile.jpg", "A moduli space for triangles, developed in conjunction with the 2018-2019 Simple Group"],
        "navlink" : ["https://en.wikipedia.org/wiki/Moduli_space", "Check It Out"],
        "briefing" : "As I rapidly progressed through the curriculum, I experienced quite a ride. I wanted to do a teaching concentration for my undergraduate degree and a pure concentration for the master's, which was unheard of to that point. Students who did a teaching concentration for their undergraduate rarely went on to grad school, and the grad students typically had a pure concentration for their undergraduate degree as well.",
        "featureImage1" : ["../src/assets/projectphotos/math/linear-algebra-3.jpg", "Work for a linear algebra project", "A crucial step in developing an algorithm for finding the best circle approximating a data cluster"],
        "featureImage2" : ["../src/assets/projectphotos/math/laplace-method.png", "Work for a problem from my Applied Analysis II class", "Use of the Laplace method for asymptotic analysis of an integral"],
        "bigFeatureImage" : ["../src/assets/projectphotos/math/senior-picture.jpg", "One of my graduation pictures featuring various mathematical jokes", "Some math 'jokes' I featured in one of my college graduation pictures"],
        "solutionImage" : ["../src/assets/projectphotos/math/radical-ideals-prime.png", "Proof that the radical of a primary ideal is prime"],
        "solution" : "I worked hard to make sure that I could complete all my goals for my education, including being done with my master's degree in four years. Many of my professors said I was the best student they had seen in their entire careers. Over time, I grew to specialize in abstract and linear algebra, but representation theory and algebraic topology also hold a special place in my heart. As I have moved more into the world of programming and web design, my linear algebra skills have come in handy, as has my training in combinatorial and discrete mathematics! The mathematical prowess has given me a boost on diving into machine learning, data analytics, and algorithms."
    }
}